adafruit/seesaw/lib/samd21/samd21d/atdf/ATSAMD21G17D.atdf
        <register name="BTCNT" offset="0x2" rw="RW" size="2" caption="Block Transfer Count">
          <bitfield name="BTCNT" caption="Block Transfer Count" mask="0xFFFF"/>
        </register>
        <register name="SRCADDR" offset="0x4" rw="RW" size="4" caption="Transfer Source Address">
          <bitfield name="SRCADDR" caption="Transfer Source Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DSTADDR" offset="0x8" rw="RW" size="4" caption="Transfer Destination Address">
          <bitfield name="DSTADDR" caption="Transfer Destination Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DESCADDR" offset="0xC" rw="RW" size="4" caption="Next Descriptor Address">
          <bitfield name="DESCADDR" caption="Next Descriptor Address" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="DMAC_BTCTRL__BEATSIZE">
        <value name="BYTE" caption="8-bit access" value="0x0"/>
        <value name="HWORD" caption="16-bit access" value="0x1"/>
        <value name="WORD" caption="32-bit access" value="0x2"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__BLOCKACT">
        <value name="NOACT" caption="No action" value="0x0"/>
        <value name="INT" caption="Channel in normal operation and block interrupt" value="0x1"/>
        <value name="SUSPEND" caption="Channel suspend operation is completed" value="0x2"/>
        <value name="BOTH" caption="Both channel suspend operation and block interrupt" value="0x3"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__EVOSEL">
        <value name="DISABLE" caption="Event generation disabled" value="0x0"/>
        <value name="BLOCK" caption="Event strobe when block transfer complete" value="0x1"/>
        <value name="BEAT" caption="Event strobe when beat transfer complete" value="0x3"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__STEPSEL">
        <value name="DST" caption="Step size settings apply to the destination address" value="0x0"/>
        <value name="SRC" caption="Step size settings apply to the source address" value="0x1"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__STEPSIZE">
        <value name="X1" caption="Next ADDR &lt;- ADDR + (1&lt;&lt;BEATSIZE) * 1" value="0x0"/>
        <value name="X2" caption="Next ADDR &lt;- ADDR + (1&lt;&lt;BEATSIZE) * 2" value="0x1"/>
        <value name="X4" caption="Next ADDR &lt;- ADDR + (1&lt;&lt;BEATSIZE) * 4" value="0x2"/>
        <value name="X8" caption="Next ADDR &lt;- ADDR + (1&lt;&lt;BEATSIZE) * 8" value="0x3"/>
        <value name="X16" caption="Next ADDR &lt;- ADDR + (1&lt;&lt;BEATSIZE) * 16" value="0x4"/>
        <value name="X32" caption="Next ADDR &lt;- ADDR + (1&lt;&lt;BEATSIZE) * 32" value="0x5"/>
        <value name="X64" caption="Next ADDR &lt;- ADDR + (1&lt;&lt;BEATSIZE) * 64" value="0x6"/>
        <value name="X128" caption="Next ADDR &lt;- ADDR + (1&lt;&lt;BEATSIZE) * 128" value="0x7"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCBEATSIZE">
        <value name="BYTE" caption="Byte bus access" value="0x0"/>
        <value name="HWORD" caption="Half-word bus access" value="0x1"/>
        <value name="WORD" caption="Word bus access" value="0x2"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCPOLY">
        <value name="CRC16" caption="CRC-16 (CRC-CCITT)" value="0x0"/>
        <value name="CRC32" caption="CRC32 (IEEE 802.3)" value="0x1"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCSRC">
        <value name="NOACT" caption="No action" value="0x00"/>
        <value name="IO" caption="I/O interface" value="0x01"/>
      </value-group>
      <value-group name="DMAC_QOSCTRL__DQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_QOSCTRL__FQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_QOSCTRL__WRBQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__CMD">
        <value name="NOACT" caption="No action" value="0x0"/>
        <value name="SUSPEND" caption="Channel suspend operation" value="0x1"/>
        <value name="RESUME" caption="Channel resume operation" value="0x2"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__EVACT">
        <value name="NOACT" caption="No action" value="0x0"/>
        <value name="TRIG" caption="Transfer and periodic transfer trigger" value="0x1"/>
        <value name="CTRIG" caption="Conditional transfer trigger" value="0x2"/>
        <value name="CBLOCK" caption="Conditional block transfer" value="0x3"/>
        <value name="SUSPEND" caption="Channel suspend operation" value="0x4"/>
        <value name="RESUME" caption="Channel resume operation" value="0x5"/>
        <value name="SSKIP" caption="Skip next block suspend action" value="0x6"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__LVL">
        <value name="LVL0" caption="Channel Priority Level 0" value="0x00"/>
        <value name="LVL1" caption="Channel Priority Level 1" value="0x01"/>
        <value name="LVL2" caption="Channel Priority Level 2" value="0x02"/>
        <value name="LVL3" caption="Channel Priority Level 3" value="0x03"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__TRIGACT">
        <value name="BLOCK" caption="One trigger required for each block transfer" value="0x0"/>
        <value name="BEAT" caption="One trigger required for each beat transfer" value="0x2"/>
        <value name="TRANSACTION" caption="One trigger required for each transaction" value="0x3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__TRIGSRC">
        <value name="DISABLE" caption="Only software/event triggers" value="0x00"/>
      </value-group>
    </module>
    <module name="DSU" id="U2209" version="2.0.4" caption="Device Service Unit">
      <register-group name="DSU" caption="Device Service Unit">
        <register name="CTRL" offset="0x0" rw="W" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="CRC" caption="32-bit Cyclic Redundancy Check" mask="0x4"/>
          <bitfield name="MBIST" caption="Memory Built-In Self-Test" mask="0x8"/>
          <bitfield name="CE" caption="Chip Erase" mask="0x10"/>
        </register>
        <register name="STATUSA" offset="0x1" rw="RW" size="1" initval="0x00" caption="Status A">
          <bitfield name="DONE" caption="Done" mask="0x1"/>
          <bitfield name="CRSTEXT" caption="CPU Reset Phase Extension" mask="0x2"/>
          <bitfield name="BERR" caption="Bus Error" mask="0x4"/>
          <bitfield name="FAIL" caption="Failure" mask="0x8"/>
          <bitfield name="PERR" caption="Protection Error" mask="0x10"/>
        </register>
        <register name="STATUSB" offset="0x2" rw="R" size="1" initval="0x10" caption="Status B">
          <bitfield name="PROT" caption="Protected" mask="0x1"/>
          <bitfield name="DBGPRES" caption="Debugger Present" mask="0x2"/>
          <bitfield name="DCCD0" caption="Debug Communication Channel 0 Dirty" mask="0x4"/>
          <bitfield name="DCCD1" caption="Debug Communication Channel 1 Dirty" mask="0x8"/>
          <bitfield name="HPE" caption="Hot-Plugging Enable" mask="0x10"/>
        </register>
