adafruit/seesaw/lib/samd21/samd21d/atdf/ATSAMD21G17D.atdf
        <register modes="HOST" name="STATUS_PIPE" offset="0xE" rw="RW" size="2" caption="HOST_DESC_BANK Host Bank, Host Status Pipe">
          <bitfield name="DTGLER" caption="Data Toggle Error" mask="0x1"/>
          <bitfield name="DAPIDER" caption="Data PID Error" mask="0x2"/>
          <bitfield name="PIDER" caption="PID Error" mask="0x4"/>
          <bitfield name="TOUTER" caption="Time Out Error" mask="0x8"/>
          <bitfield name="CRC16ER" caption="CRC16 Error" mask="0x10"/>
          <bitfield name="ERCNT" caption="Pipe Error Count" mask="0xE0"/>
        </register>
      </register-group>
      <register-group name="DEVICE_ENDPOINT" size="0x20">
        <mode name="DEVICE" qualifier="USB.CTRLA.MODE" value="0" caption="USB is Device"/>
        <register modes="DEVICE" name="EPCFG" offset="0x0" rw="RW" size="1" initval="0x00" caption="DEVICE_ENDPOINT End Point Configuration">
          <bitfield name="EPTYPE0" caption="End Point Type0" mask="0x7"/>
          <bitfield name="EPTYPE1" caption="End Point Type1" mask="0x70"/>
          <bitfield name="NYETDIS" caption="NYET Token Disable" mask="0x80"/>
        </register>
        <register modes="DEVICE" name="EPSTATUSCLR" offset="0x4" rw="W" size="1" atomic-op="clear:EPSTATUS" initval="0x00" caption="DEVICE_ENDPOINT End Point Pipe Status Clear">
          <bitfield name="DTGLOUT" caption="Data Toggle OUT Clear" mask="0x1"/>
          <bitfield name="DTGLIN" caption="Data Toggle IN Clear" mask="0x2"/>
          <bitfield name="CURBK" caption="Curren Bank Clear" mask="0x4"/>
          <bitfield name="STALLRQ0" caption="Stall 0 Request Clear" mask="0x10"/>
          <bitfield name="STALLRQ1" caption="Stall 1 Request Clear" mask="0x20"/>
          <bitfield name="BK0RDY" caption="Bank 0 Ready Clear" mask="0x40"/>
          <bitfield name="BK1RDY" caption="Bank 1 Ready Clear" mask="0x80"/>
        </register>
        <register modes="DEVICE" name="EPSTATUSSET" offset="0x5" rw="W" size="1" atomic-op="set:EPSTATUS" initval="0x00" caption="DEVICE_ENDPOINT End Point Pipe Status Set">
          <bitfield name="DTGLOUT" caption="Data Toggle OUT Set" mask="0x1"/>
          <bitfield name="DTGLIN" caption="Data Toggle IN Set" mask="0x2"/>
          <bitfield name="CURBK" caption="Current Bank Set" mask="0x4"/>
          <bitfield name="STALLRQ0" caption="Stall 0 Request Set" mask="0x10"/>
          <bitfield name="STALLRQ1" caption="Stall 1 Request Set" mask="0x20"/>
          <bitfield name="BK0RDY" caption="Bank 0 Ready Set" mask="0x40"/>
          <bitfield name="BK1RDY" caption="Bank 1 Ready Set" mask="0x80"/>
        </register>
        <register modes="DEVICE" name="EPSTATUS" offset="0x6" rw="R" size="1" initval="0x00" caption="DEVICE_ENDPOINT End Point Pipe Status">
          <bitfield name="DTGLOUT" caption="Data Toggle Out" mask="0x1"/>
          <bitfield name="DTGLIN" caption="Data Toggle In" mask="0x2"/>
          <bitfield name="CURBK" caption="Current Bank" mask="0x4"/>
          <bitfield name="STALLRQ0" caption="Stall 0 Request" mask="0x10"/>
          <bitfield name="STALLRQ1" caption="Stall 1 Request" mask="0x20"/>
          <bitfield name="BK0RDY" caption="Bank 0 ready" mask="0x40"/>
          <bitfield name="BK1RDY" caption="Bank 1 ready" mask="0x80"/>
        </register>
        <register modes="DEVICE" name="EPINTFLAG" offset="0x7" rw="RW" size="1" atomic-op="clear:EPINTFLAG" initval="0x00" caption="DEVICE_ENDPOINT End Point Interrupt Flag">
          <bitfield name="TRCPT0" caption="Transfer Complete 0" mask="0x1"/>
          <bitfield name="TRCPT1" caption="Transfer Complete 1" mask="0x2"/>
          <bitfield name="TRFAIL0" caption="Error Flow 0" mask="0x4"/>
          <bitfield name="TRFAIL1" caption="Error Flow 1" mask="0x8"/>
          <bitfield name="RXSTP" caption="Received Setup" mask="0x10"/>
          <bitfield name="STALL0" caption="Stall 0 In/out" mask="0x20"/>
          <bitfield name="STALL1" caption="Stall 1 In/out" mask="0x40"/>
        </register>
        <register modes="DEVICE" name="EPINTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:EPINTENCLR" initval="0x00" caption="DEVICE_ENDPOINT End Point Interrupt Clear Flag">
          <bitfield name="TRCPT0" caption="Transfer Complete 0 Interrupt Disable" mask="0x1"/>
          <bitfield name="TRCPT1" caption="Transfer Complete 1 Interrupt Disable" mask="0x2"/>
          <bitfield name="TRFAIL0" caption="Error Flow 0 Interrupt Disable" mask="0x4"/>
          <bitfield name="TRFAIL1" caption="Error Flow 1 Interrupt Disable" mask="0x8"/>
          <bitfield name="RXSTP" caption="Received Setup Interrupt Disable" mask="0x10"/>
          <bitfield name="STALL0" caption="Stall 0 In/Out Interrupt Disable" mask="0x20"/>
          <bitfield name="STALL1" caption="Stall 1 In/Out Interrupt Disable" mask="0x40"/>
        </register>
        <register modes="DEVICE" name="EPINTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:EPINTENSET" initval="0x00" caption="DEVICE_ENDPOINT End Point Interrupt Set Flag">
          <bitfield name="TRCPT0" caption="Transfer Complete 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="TRCPT1" caption="Transfer Complete 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="TRFAIL0" caption="Error Flow 0 Interrupt Enable" mask="0x4"/>
          <bitfield name="TRFAIL1" caption="Error Flow 1 Interrupt Enable" mask="0x8"/>
          <bitfield name="RXSTP" caption="Received Setup Interrupt Enable" mask="0x10"/>
          <bitfield name="STALL0" caption="Stall 0 In/out Interrupt enable" mask="0x20"/>
          <bitfield name="STALL1" caption="Stall 1 In/out Interrupt enable" mask="0x40"/>
        </register>
      </register-group>
      <register-group name="HOST_PIPE" size="0x20">
        <mode name="HOST" qualifier="USB.CTRLA.MODE" value="1" caption="USB is Host"/>
        <register modes="HOST" name="PCFG" offset="0x0" rw="RW" size="1" initval="0x00" caption="HOST_PIPE End Point Configuration">
          <bitfield name="PTOKEN" caption="Pipe Token" mask="0x3"/>
          <bitfield name="BK" caption="Pipe Bank" mask="0x4"/>
          <bitfield name="PTYPE" caption="Pipe Type" mask="0x38"/>
        </register>
